lantiansb/Noise-monitor/v1.5+/1.模块选型/2.4G/AS01-SPIPX/开发板资料/AS06-VTB01/程序源码/Demo_NRF24L01P_HC32L110C4UA/hc32l110_prj/periph/inc/cmt2300a_defs.h
/* ********** CMT2300A_CUS_PKT19 registers ********** */
#define CMT2300A_MASK_NODE_VALUE_23_16   0xFF

/* ********** CMT2300A_CUS_PKT20 registers ********** */
#define CMT2300A_MASK_NODE_VALUE_31_24   0xFF

/* ********** CMT2300A_CUS_PKT21 registers ********** */
#define CMT2300A_MASK_FEC_TYPE           0x80
#define CMT2300A_MASK_FEC_EN             0x40
#define CMT2300A_MASK_CRC_BYTE_SWAP      0x20
#define CMT2300A_MASK_CRC_BIT_INV        0x10
#define CMT2300A_MASK_CRC_RANGE          0x08
#define CMT2300A_MASK_CRC_TYPE           0x06
#define CMT2300A_MASK_CRC_EN             0x01
/* CMT2300A_MASK_CRC_BYTE_SWAP options */
#define CMT2300A_CRC_ORDER_HBYTE         0x00
#define CMT2300A_CRC_ORDER_LBYTE         0x20
/* CMT2300A_MASK_CRC_RANGE options */
#define CMT2300A_CRC_RANGE_PAYLOAD       0x00
#define CMT2300A_CRC_RANGE_DATA          0x08
/* CMT2300A_MASK_CRC_TYPE options */
#define CMT2300A_CRC_TYPE_CCITT16        0x00
#define CMT2300A_CRC_TYPE_IBM16          0x02
#define CMT2300A_CRC_TYPE_ITU16          0x04

/* ********** CMT2300A_CUS_PKT22 registers ********** */
#define CMT2300A_MASK_CRC_SEED_7_0       0xFF

/* ********** CMT2300A_CUS_PKT23 registers ********** */
#define CMT2300A_MASK_CRC_SEED_15_8      0xFF

/* ********** CMT2300A_CUS_PKT24 registers ********** */
#define CMT2300A_MASK_CRC_BIT_ORDER      0x80
#define CMT2300A_MASK_WHITEN_SEED_8_8    0x40
#define CMT2300A_MASK_WHITEN_SEED_TYPE   0x20
#define CMT2300A_MASK_WHITEN_TYPE        0x18
#define CMT2300A_MASK_WHITEN_EN          0x04
#define CMT2300A_MASK_MANCH_TYPE         0x02
#define CMT2300A_MASK_MANCH_EN           0x01
/* CMT2300A_MASK_CRC_BIT_ORDER options */
#define CMT2300A_CRC_BIT_ORDER_MSB       0x00
#define CMT2300A_CRC_BIT_ORDER_LSB       0x80
/* CMT2300A_MASK_WHITEN_SEED_TYPE options */
#define CMT2300A_WHITEN_SEED_TYPE_1      0x00
#define CMT2300A_WHITEN_SEED_TYPE_2      0x20
/* CMT2300A_MASK_WHITEN_TYPE options */
#define CMT2300A_WHITEN_TYPE_PN9_CCITT   0x00
#define CMT2300A_WHITEN_TYPE_PN9_IBM     0x08
#define CMT2300A_WHITEN_TYPE_PN7         0x10
/* CMT2300A_MASK_MANCH_TYPE options */
#define CMT2300A_MANCH_TYPE_ONE_01       0x00
#define CMT2300A_MANCH_TYPE_ONE_10       0x02

/* ********** CMT2300A_CUS_PKT25 registers ********** */
#define CMT2300A_MASK_WHITEN_SEED_7_0    0xFF

/* ********** CMT2300A_CUS_PKT26 registers ********** */
#define CMT2300A_MASK_TX_PREFIX_TYPE     0x03

/* ********** CMT2300A_CUS_PKT27 registers ********** */
#define CMT2300A_MASK_TX_PKT_NUM         0xFF

/* ********** CMT2300A_CUS_PKT28 registers ********** */
#define CMT2300A_MASK_TX_PKT_GAP         0xFF

/* ********** CMT2300A_CUS_PKT29 registers ********** */
#define CMT2300A_MASK_FIFO_AUTO_RES_EN   0x80
#define CMT2300A_MASK_FIFO_TH            0x7F

/* ********** CMT2300A_CUS_MODE_CTL registers ********** */
#define CMT2300A_MASK_CHIP_MODE_SWT      0xFF
/* CMT2300A_MASK_CHIP_MODE_SWT options */
#define CMT2300A_GO_EEPROM               0x01
#define CMT2300A_GO_STBY                 0x02
#define CMT2300A_GO_RFS                  0x04
#define CMT2300A_GO_RX                   0x08
#define CMT2300A_GO_SLEEP                0x10
#define CMT2300A_GO_TFS                  0x20
#define CMT2300A_GO_TX                   0x40
#define CMT2300A_GO_SWITCH               0x80

/* ********** CMT2300A_CUS_MODE_STA registers ********** */
#define CMT2300A_MASK_RSTN_IN_EN         0x20
#define CMT2300A_MASK_CFG_RETAIN         0x10
#define CMT2300A_MASK_CHIP_MODE_STA      0x0F
/* CMT2300A_MASK_CHIP_MODE_STA options */
#define CMT2300A_STA_IDLE                0x00
#define CMT2300A_STA_SLEEP               0x01
#define CMT2300A_STA_STBY                0x02
#define CMT2300A_STA_RFS                 0x03
#define CMT2300A_STA_TFS                 0x04
#define CMT2300A_STA_RX                  0x05
#define CMT2300A_STA_TX                  0x06
#define CMT2300A_STA_EEPROM              0x07
#define CMT2300A_STA_ERROR               0x08
#define CMT2300A_STA_CAL                 0x09

/* ********** CMT2300A_CUS_EN_CTL registers ********** */
#define CMT2300A_MASK_LOCKING_EN         0x20

/* ********** CMT2300A_CUS_FREQ_CHNL registers ********** */
#define CMT2300A_MASK_FH_CHANNEL         0xFF

/* ********** CMT2300A_CUS_FREQ_OFS registers ********** */
#define CMT2300A_MASK_FH_OFFSET          0xFF

/* ********** CMT2300A_CUS_IO_SEL registers ********** */
#define CMT2300A_MASK_GPIO4_SEL          0xC0
#define CMT2300A_MASK_GPIO3_SEL          0x30
#define CMT2300A_MASK_GPIO2_SEL          0x0C
#define CMT2300A_MASK_GPIO1_SEL          0x03
/* CMT2300A_MASK_GPIO4_SEL options */
#define CMT2300A_GPIO4_SEL_RSTIN         0x00
#define CMT2300A_GPIO4_SEL_INT1          0x40
#define CMT2300A_GPIO4_SEL_DOUT          0x80
#define CMT2300A_GPIO4_SEL_DCLK          0xC0
/* CMT2300A_MASK_GPIO3_SEL options */
#define CMT2300A_GPIO3_SEL_CLKO          0x00
#define CMT2300A_GPIO3_SEL_DOUT          0x10
#define CMT2300A_GPIO3_SEL_DIN           0x10
#define CMT2300A_GPIO3_SEL_INT2          0x20
#define CMT2300A_GPIO3_SEL_DCLK          0x30
/* CMT2300A_MASK_GPIO2_SEL options */
#define CMT2300A_GPIO2_SEL_INT1          0x00
#define CMT2300A_GPIO2_SEL_INT2          0x04
#define CMT2300A_GPIO2_SEL_DOUT          0x08
#define CMT2300A_GPIO2_SEL_DIN           0x08
#define CMT2300A_GPIO2_SEL_DCLK          0x0C
/* CMT2300A_MASK_GPIO1_SEL options */
#define CMT2300A_GPIO1_SEL_DOUT          0x00
#define CMT2300A_GPIO1_SEL_DIN           0x00
#define CMT2300A_GPIO1_SEL_INT1          0x01
#define CMT2300A_GPIO1_SEL_INT2          0x02
#define CMT2300A_GPIO1_SEL_DCLK          0x03

/* ********** CMT2300A_CUS_INT1_CTL registers ********** */
#define CMT2300A_MASK_RF_SWT1_EN         0x80
#define CMT2300A_MASK_RF_SWT2_EN         0x40
#define CMT2300A_MASK_INT_POLAR          0x20
#define CMT2300A_MASK_INT1_SEL           0x1F
/* CMT2300A_MASK_INT_POLAR options */
#define CMT2300A_INT_POLAR_SEL_0         0x00
#define CMT2300A_INT_POLAR_SEL_1         0x20
/* CMT2300A_MASK_INT1_SEL options */
#define CMT2300A_INT_SEL_RX_ACTIVE       0x00
#define CMT2300A_INT_SEL_TX_ACTIVE       0x01
#define CMT2300A_INT_SEL_RSSI_VLD        0x02
#define CMT2300A_INT_SEL_PREAM_OK        0x03
#define CMT2300A_INT_SEL_SYNC_OK         0x04
#define CMT2300A_INT_SEL_NODE_OK         0x05
#define CMT2300A_INT_SEL_CRC_OK          0x06
#define CMT2300A_INT_SEL_PKT_OK          0x07
#define CMT2300A_INT_SEL_SL_TMO          0x08
#define CMT2300A_INT_SEL_RX_TMO          0x09
#define CMT2300A_INT_SEL_TX_DONE         0x0A
#define CMT2300A_INT_SEL_RX_FIFO_NMTY    0x0B
#define CMT2300A_INT_SEL_RX_FIFO_TH      0x0C
#define CMT2300A_INT_SEL_RX_FIFO_FULL    0x0D
#define CMT2300A_INT_SEL_RX_FIFO_WBYTE   0x0E
#define CMT2300A_INT_SEL_RX_FIFO_OVF     0x0F
#define CMT2300A_INT_SEL_TX_FIFO_NMTY    0x10
#define CMT2300A_INT_SEL_TX_FIFO_TH      0x11
#define CMT2300A_INT_SEL_TX_FIFO_FULL    0x12
#define CMT2300A_INT_SEL_STATE_IS_STBY   0x13
#define CMT2300A_INT_SEL_STATE_IS_FS     0x14
#define CMT2300A_INT_SEL_STATE_IS_RX     0x15
#define CMT2300A_INT_SEL_STATE_IS_TX     0x16
#define CMT2300A_INT_SEL_LED             0x17
#define CMT2300A_INT_SEL_TRX_ACTIVE      0x18
#define CMT2300A_INT_SEL_PKT_DONE        0x19

/* ********** CMT2300A_CUS_INT2_CTL registers ********** */
#define CMT2300A_MASK_LFOSC_OUT_EN       0x40
#define CMT2300A_MASK_TX_DIN_INV         0x20
#define CMT2300A_MASK_INT2_SEL           0x1F

/* ********** CMT2300A_CUS_INT_EN registers ********** */
#define CMT2300A_MASK_SL_TMO_EN          0x80
#define CMT2300A_MASK_RX_TMO_EN          0x40
#define CMT2300A_MASK_TX_DONE_EN         0x20
#define CMT2300A_MASK_PREAM_OK_EN        0x10
#define CMT2300A_MASK_SYNC_OK_EN         0x08
#define CMT2300A_MASK_NODE_OK_EN         0x04
#define CMT2300A_MASK_CRC_OK_EN          0x02
#define CMT2300A_MASK_PKT_DONE_EN        0x01

/* ********** CMT2300A_CUS_FIFO_CTL registers ********** */
#define CMT2300A_MASK_TX_DIN_EN          0x80
#define CMT2300A_MASK_TX_DIN_SEL         0x60
#define CMT2300A_MASK_FIFO_AUTO_CLR_DIS  0x10
#define CMT2300A_MASK_FIFO_TX_RD_EN      0x08
#define CMT2300A_MASK_FIFO_RX_TX_SEL     0x04
#define CMT2300A_MASK_FIFO_MERGE_EN      0x02
#define CMT2300A_MASK_SPI_FIFO_RD_WR_SEL 0x01
/* CMT2300A_MASK_TX_DIN_SEL options */
#define CMT2300A_TX_DIN_SEL_GPIO1        0x00
#define CMT2300A_TX_DIN_SEL_GPIO2        0x20
#define CMT2300A_TX_DIN_SEL_GPIO3        0x40

/* ********** CMT2300A_CUS_INT_CLR1 registers ********** */
#define CMT2300A_MASK_SL_TMO_FLG         0x20
#define CMT2300A_MASK_RX_TMO_FLG         0x10
#define CMT2300A_MASK_TX_DONE_FLG        0x08
#define CMT2300A_MASK_TX_DONE_CLR        0x04
#define CMT2300A_MASK_SL_TMO_CLR         0x02
#define CMT2300A_MASK_RX_TMO_CLR         0x01

/* ********** CMT2300A_CUS_INT_CLR2 registers ********** */
#define CMT2300A_MASK_LBD_CLR            0x20
#define CMT2300A_MASK_PREAM_OK_CLR       0x10
#define CMT2300A_MASK_SYNC_OK_CLR        0x08
#define CMT2300A_MASK_NODE_OK_CLR        0x04
#define CMT2300A_MASK_CRC_OK_CLR         0x02
#define CMT2300A_MASK_PKT_DONE_CLR       0x01

/* ********** CMT2300A_CUS_FIFO_CLR registers ********** */
#define CMT2300A_MASK_FIFO_RESTORE       0x04
#define CMT2300A_MASK_FIFO_CLR_RX        0x02
#define CMT2300A_MASK_FIFO_CLR_TX        0x01

/* ********** CMT2300A_CUS_INT_FLAG registers ********** */
#define CMT2300A_MASK_LBD_FLG            0x80
#define CMT2300A_MASK_COL_ERR_FLG        0x40
#define CMT2300A_MASK_PKT_ERR_FLG        0x20
#define CMT2300A_MASK_PREAM_OK_FLG       0x10
#define CMT2300A_MASK_SYNC_OK_FLG        0x08
#define CMT2300A_MASK_NODE_OK_FLG        0x04
#define CMT2300A_MASK_CRC_OK_FLG         0x02
#define CMT2300A_MASK_PKT_OK_FLG         0x01

/* ********** CMT2300A_CUS_FIFO_FLAG registers ********** */
#define CMT2300A_MASK_RX_FIFO_FULL_FLG   0x40
#define CMT2300A_MASK_RX_FIFO_NMTY_FLG   0x20
#define CMT2300A_MASK_RX_FIFO_TH_FLG     0x10
#define CMT2300A_MASK_RX_FIFO_OVF_FLG    0x08
#define CMT2300A_MASK_TX_FIFO_FULL_FLG   0x04
#define CMT2300A_MASK_TX_FIFO_NMTY_FLG   0x02
#define CMT2300A_MASK_TX_FIFO_TH_FLG     0x01

/* ********** CMT2300A_CUS_RSSI_CODE registers ********** */
#define CMT2300A_MASK_RSSI_CODE          0xFF

/* ********** CMT2300A_CUS_RSSI_DBM registers ********** */
#define CMT2300A_MASK_RSSI_DBM           0xFF

/* ********** CMT2300A_CUS_LBD_RESULT registers ********** */
#define CMT2300A_MASK_LBD_RESULT         0xFF


#endif


